X = {
    "关": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1,
    },
    "张": {
        "部门": "科技部",
        "工资": 5000,
        "级别": 2,
    },
    "赵": {
        "部门": "科技部",
        "工资": 7000,
        "级别": 3,
    },
    "马": {
        "部门": "科技部",
        "工资": 4000,
        "级别": 1,
    },
    "黄": {
        "部门": "科技部",
        "工资": 6000,
        "级别": 2,
    }
}
for i in X:
    if X[i]["级别"] == 1:
        X[i]["级别"] = 2
    X[i]["工资"] += 1000
print(X)
print(len(X))
print(max(X))
# 当字典转成其他容器时，如列表，元组，集合，抛弃值只保留关键字，但如果转换成字符串则值保留
